import { Institute } from '../models/user.model';

export const MOCK_INSTITUTES: Institute[] = [
  { id: 1, name: 'موسسه زبان سفیر گفتمان', city: 'تهران', description: 'یکی از بزرگترین مراکز تخصصی آموزش زبان به بزرگسالان، متمرکز بر آمادگی آزمون‌های بین‌المللی IELTS و TOEFL.' },
  { id: 2, name: 'موسسه زبان ایرانمهر', city: 'تهران', description: 'ارائه دهنده دوره‌های متنوع زبان برای تمام سنین با استفاده از جدیدترین متدهای آموزشی مبتنی بر تکنولوژی.' },
  { id: 3, name: 'موسسه زبان کیش', city: 'تهران', description: 'با سابقه‌ای درخشان در برگزاری دوره‌های مکالمه فشرده و زبان انگلیسی تجاری (Business English).' },
  { id: 4, name: 'موسسه زبان پارسیان', city: 'شیراز', description: 'مرکز تخصصی آموزش زبان انگلیسی در جنوب کشور با تمرکز بر دوره‌های نوجوانان و آمادگی کنکور سراسری زبان.' },
  { id: 5, name: 'موسسه زبان آفاق', city: 'شیراز', description: 'محیطی پویا و دوستانه برای یادگیری زبان، معروف به برگزاری کارگاه‌های Free Discussion و پخش فیلم.' },
  { id: 6, name: 'موسسه زبان سپاهان', city: 'اصفهان', description: 'پیشرو در آموزش زبان با لهجه آمریکایی و برگزاری دوره‌های تخصصی TTC (تربیت مدرس زبان).' },
  { id: 7, name: 'موسسه زبان پارت', city: 'مشهد', description: 'متخصص در آموزش زبان انگلیسی به کودکان از طریق بازی و سرگرمی با کتاب‌های درسی انتشارات آکسفورد.' },
  { id: 8, name: 'موسسه زبان کومش', city: 'شاهرود', description: 'مرکز تخصصی برگزاری دوره‌های آمادگی آزمون‌های زبان دکتری (MSRT, EPT) و آزمون‌های تولیمو.' },
  { id: 9, name: 'موسسه زبان فیروزکوه', city: 'فیروزکوه', description: 'ارائه دهنده دوره‌های عمومی زبان انگلیسی برای تمام سطوح با تمرکز بر تقویت هر چهار مهارت اصلی.' },
  { id: 10, name: 'موسسه زبان آریان', city: 'اراک', description: 'با کادری مجرب و متعهد، متخصص در برگزاری کلاس‌های خصوصی و نیمه‌خصوصی برای پیشرفت سریع زبان‌آموزان.' },
  { id: 11, name: 'موسسه زبان سهند', city: 'تبریز', description: 'آموزش زبان با رویکرد ارتباطی (Communicative Approach) و برگزاری کارگاه‌های فرهنگی برای آشنایی با آداب و رسوم انگلیسی‌زبان.' },
  { id: 12, name: 'موسسه زبان سبلان', city: 'اردبیل', description: 'متخصص در دوره‌های آمادگی آزمون‌های بین‌المللی و ارائه مشاوره تخصصی برای مهاجرت تحصیلی.' },
  { id: 13, name: 'موسسه زبان خلیج فارس', city: 'بوشهر', description: 'متخصص در دوره‌های فشرده مکالمه برای بزرگسالان و پرسنل شرکت‌های صنعتی و دریایی منطقه.' },
  { id: 14, name: 'موسسه زبان گیلان', city: 'رشت', description: 'برگزاری دوره‌های تخصصی زبان انگلیسی برای صنعت گردشگری (Tourism English) و راهنمایان تور.' },
  { id: 15, name: 'موسسه زبان دانا', city: 'بوشهر', description: 'متمرکز بر دوره‌های مکالمه و مهارت‌های شنیداری با استفاده از به‌روزترین منابع صوتی و تصویری.' }
];